//======================================================================================================================
//
//１０月２４日：攻撃用のクラスを作る[BgModel.cpp]
//Author:ShinaTaiyo
//
//======================================================================================================================

//==================================================================
//インクルード
//==================================================================
#include "bgModel.h"
#include "manager.h"
#include "objectX.h"
#include "objectXInfo.h"
//======================================================================================================================


//==================================================================
//前方宣言
//==================================================================
const string CBgModel::BGMODEL_FILENAME[CBgModel::BGMODELTYPE::TYPE_MAX] =
{
	"data\\MODEL\\BgModel\\bill.x",
	"data\\MODEL\\BgModel\\Tree_000.x",
};
//======================================================================================================================

//==================================================================
//コンストラクタ
//==================================================================
CBgModel::CBgModel() : m_Type(BGMODELTYPE::TYPE_BILL_00)
{

}
//======================================================================================================================

//==================================================================
//デストラクタ
//==================================================================
CBgModel::~CBgModel()
{

}
//======================================================================================================================

//==================================================================
//初期化処理
//==================================================================
HRESULT CBgModel::Init()
{
	CObjectX::Init();
	return S_OK;
}
//======================================================================================================================

//==================================================================
//終了処理
//==================================================================
void CBgModel::Uninit()
{
	CObjectX::Uninit();
}
//======================================================================================================================

//==================================================================
//更新処理
//==================================================================
void CBgModel::Update()
{
	CObjectX::Update();
}
//======================================================================================================================

//==================================================================
//描画処理
//==================================================================
void CBgModel::Draw()
{
	CObjectX::Draw();
}
//======================================================================================================================

//==================================================================
//死亡フラグ設定処理
//==================================================================
void CBgModel::SetDeath()
{
	CObject::SetDeath();
}
//======================================================================================================================

//==================================================================
//生成処理
//==================================================================
CBgModel* CBgModel::Create(BGMODELTYPE bgModelType, D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 Scale)
{
	CBgModel* pBgModel = DBG_NEW CBgModel;     //生成

	pBgModel->Init();                        //初期化処理
	pBgModel->SetType(CObject::TYPE::BGMODEL);//オブジェクトごとのタイプを設定する
	pBgModel->SetBgModelType(bgModelType);   //背景モデルの種類を設定する
	pBgModel->SetPos(pos);                   //位置  
	pBgModel->SetSupportPos(pos);            //支点となる位置を設定
	pBgModel->SetRot(rot);                   //向き
	pBgModel->SetScale(Scale);               //拡大率

	//モデル情報設定
	int nIdx = CManager::GetObjectXInfo()->Regist(BGMODEL_FILENAME[bgModelType]);

	//モデル情報を割り当てる
	pBgModel->BindObjectXInfo(CManager::GetObjectXInfo()->GetMesh(nIdx),
		CManager::GetObjectXInfo()->GetBuffMat(nIdx),
		CManager::GetObjectXInfo()->GetdwNumMat(nIdx),
		CManager::GetObjectXInfo()->GetTexture(nIdx),
		CManager::GetObjectXInfo()->GetColorValue(nIdx));

	pBgModel->SetManagerObjectType(CObject::MANAGEROBJECTTYPE_BGMODEL);           //マネージャーで呼び出す時の種類を設定

	return pBgModel;
}
//======================================================================================================================


//==================================================================
//ステージマネージャーに情報を保存する
//==================================================================
void CBgModel::SaveInfoTxt(fstream& WritingFile)
{
	WritingFile << "SETBGMODEL" << endl;
	WritingFile << "TYPE = " << m_Type;
	switch (m_Type)
	{
	case BGMODELTYPE::TYPE_BILL_00:
		WritingFile << " # BILL00" << endl;
		break;
	case BGMODELTYPE::TYPE_TREE_00:
		WritingFile << " # TREE00" << endl;
		break;
	default:
		break;
	}

	CObjectX::SaveInfoTxt(WritingFile);

	WritingFile << "END_SETBGMODEL" << endl;

}
//======================================================================================================================

//==================================================================
//ステージマネージャーから情報を読み込む
//==================================================================
void CBgModel::LoadInfoTxt(fstream& LoadingFile, vector<CObject*>& VecSaveManager, string& Buff)
{
	int nType = 0;//種類
	int nLife = 0;//体力
	D3DXVECTOR3 Move = NULL_VECTOR3;  //移動量
	D3DXVECTOR3 Pos = NULL_VECTOR3;   //位置
	D3DXVECTOR3 Scale = NULL_VECTOR3; //拡大率
	D3DXVECTOR3 Rot = NULL_VECTOR3;   //向き
	BGMODELTYPE Type = {};            //背景モデルの種類
	while (Buff != "END_SETBGMODEL")
	{
		LoadingFile >> Buff;//単語を読み込む
		if (Buff == "#")
		{
			getline(LoadingFile, Buff);
		}
		else if (Buff == "TYPE")
		{
			LoadingFile >> Buff;//イコール
			LoadingFile >> nType;      //種類
		}
		else if (Buff == "POS")
		{
			LoadingFile >> Buff;//イコール
			LoadingFile >> Pos.x;      //位置X
			LoadingFile >> Pos.y;      //位置Y
			LoadingFile >> Pos.z;      //位置Z
		}
		else if (Buff == "ROT")
		{
			LoadingFile >> Buff;//イコール
			LoadingFile >> Rot.x;      //位置X
			LoadingFile >> Rot.y;      //位置Y
			LoadingFile >> Rot.z;      //位置Z
		}
		else if (Buff == "SCALE")
		{
			LoadingFile >> Buff;//イコール
			LoadingFile >> Scale.x;      //拡大率X
			LoadingFile >> Scale.y;      //拡大率Y
			LoadingFile >> Scale.z;      //拡大率Z
		}
	}
	Type = BGMODELTYPE(nType);

	VecSaveManager.push_back(CBgModel::Create(Type,Pos, Rot, Scale));//vectorに情報を保存する

}
//======================================================================================================================

//==================================================================
//種類を変える
//==================================================================
CObject* CBgModel::ManagerChengeObject(bool bAim)
{
	int nNewType = int(m_Type);
	BGMODELTYPE NewType = {};
	const D3DXVECTOR3& Pos = GetPos();
	//=======================================
	//種類を変える
	//=======================================
	if (bAim == true)
	{
		nNewType++;
	}
	else
	{
		nNewType--;
	}
	if (nNewType >= BGMODELTYPE::TYPE_MAX)
	{
		nNewType = 0;
	}
	if (nNewType < 0)
	{
		nNewType = BGMODELTYPE::TYPE_MAX - 1;
	}
	//======================================================================================

	//=======================================
	//設定する
	//=======================================
	NewType = BGMODELTYPE(nNewType);
	//======================================================================================

	//=======================================
	//死亡フラグを設定する
	//=======================================
	SetUseDeath(true);
	SetDeath();
	//======================================================================================

	return CBgModel::Create(NewType, GetPos(), GetRot(), GetScale());//生成したオブジェクトを返す
}
//======================================================================================================================

//==================================================================
//情報を保存する
//==================================================================
CObject* CBgModel::ManagerSaveObject()
{
	return CBgModel::Create(m_Type,GetPos(),GetRot(),GetScale());//生成したオブジェクトを返す
}
//======================================================================================================================
