//===============================================================================
//
//２０２５年３月１８日：コンボを実装する[combo.h]
//Author:ShinaTaiyo
//
//===============================================================================

//========================================
//２重インクルード防止
//========================================
#ifndef _COMBO_H_  
#define _COMBO_H_
//===============================================================================


//========================================
//インクルード
//========================================
#include "main.h"
#include "object.h"
#include "ui.h"
//===============================================================================

//========================================
//コンボクラス
//========================================
class CCombo : public CObject

{
public:
	//ランク列挙型
	enum class RANK
	{
		E = 0,
		D,
		C,
		B,
		A,
		S,
		SS,
		SSS,
		MAX
	};

	//通常
	CCombo(int nPri = 0, bool bUseintPri = false, CObject::TYPE type = CObject::TYPE::COMBO, CObject::OBJECTTYPE ObjType = CObject::OBJECTTYPE::OBJECTTYPE_NONE);//コンストラクタ
	~CCombo() override;                                            //デストラクタ
	HRESULT Init() override;                                       //初期化処理
	void Uninit() override;                                        //終了処理
	void Update() override;                                        //更新処理
	void Draw() override;                                          //描画処理
	void SetDeath() override;                                      //死亡フラグ設定処理
	static CCombo* Create(D3DXVECTOR3 Pos);                        //生成処理
private:
	//=================
	//静的メンバ
	//=================

	//===========================================================

	//=================
	//関数
	//=================

	//===========================================================

	//=================
	//メンバ変数
	//=================
	int m_nCombo = 0;             //コンボ数
	RANK m_Rank = RANK::E;        //Eランク
	float m_fMagnification = 0.0f;//スコア倍率
	CUi* m_pComboDisp = nullptr;    //コンボ数表示UI
	//===========================================================
};
//===============================================================================

#endif