//======================================================================================================================================
//
//９月１５日：ボス登場演出を作る[eventmanager.cpp]
//Author:ShinaTaiyo
//
//======================================================================================================================================

//=====================================================================
//インクルード
//=====================================================================
#include "eventmanager.h"
#include "camera.h"
#include "renderer.h"
#include "object.h"
#include "sound.h"
#include "fade.h"
#include "debugproc.h"
#include "manager.h"
#include "calculation.h"
#include "particle2d.h"
#include "ui.h"
//======================================================================================================================================

//=====================================================================
//コンストラクタ
//=====================================================================
CEventManager::CEventManager(CNowEvent* pNowEvent) : m_pNowEvent(pNowEvent), m_EventProgressInfo({})
{

}
//======================================================================================================================================

//=====================================================================
//デストラクタ
//=====================================================================
CEventManager::~CEventManager()
{

}
//======================================================================================================================================

//=====================================================================
//初期化処理
//=====================================================================
HRESULT CEventManager::Init()
{
	CObject::Init();
	return S_OK;
}
//======================================================================================================================================

//=====================================================================
//終了処理
//=====================================================================
void CEventManager::Uninit()
{
	CObject::Uninit();
}
//======================================================================================================================================

//=====================================================================
//更新処理
//=====================================================================
void CEventManager::Update()
{
	//常にイベント時間をカウントする
	m_EventProgressInfo.nCntEventTime++;//イベント時間をカウントする

	m_pNowEvent->Process(this);//それぞれのイベントの処理を呼ぶ

	CObject::Update();
}
//======================================================================================================================================

//=====================================================================
//描画処理
//=====================================================================
void CEventManager::Draw()
{
	CObject::Draw();
}
//======================================================================================================================================

//=====================================================================
//死亡フラグ設定処理
//=====================================================================
void CEventManager::SetDeath()
{
	CObject::SetDeath();

	if (GetUseDeath() == true)
	{
		if (m_pNowEvent != nullptr)
		{
			delete m_pNowEvent;
			m_pNowEvent = nullptr;
		}
	}
}
//======================================================================================================================================


//=====================================================================
//イベント変更処理
//=====================================================================
void CEventManager::ChengeEvent(CNowEvent* pNowEvent)
{
	if (m_pNowEvent != nullptr)
	{
		//破棄
		delete m_pNowEvent;
		m_pNowEvent = nullptr;

		//生成
		m_pNowEvent = pNowEvent;
	}
}
//======================================================================================================================================

//=====================================================================
//イベントの生成
//=====================================================================
CEventManager* CEventManager::Create(CNowEvent* pNowEvent)
{
	CEventManager* pEventManager = DBG_NEW CEventManager(pNowEvent);

	pEventManager->Init();//初期化処理
	pEventManager->SetUseDeath(false);

	return pEventManager;
}
//======================================================================================================================================

//=====================================================================
//イベントを次のパターンへ進める
//=====================================================================
void CEventManager::EventProgressInfo::NextPattern()
{
	nCntEventTime = 0;
	nEventPattern++;
}
//======================================================================================================================================

//=====================================================================
//イベントパターンをリセットする
//=====================================================================
void CEventManager::EventProgressInfo::ResetPattern()
{
	nCntEventTime = 0;
	nEventPattern = 0;
	bEventProgress = false;
	EventType = EVENTTYPE::NONE;
}
//======================================================================================================================================

//*********************************************************************
//*フェーズ移行イベントステート
//*********************************************************************

//=====================================================================
//コンストラクタ
//=====================================================================
CNowEvent_NextPhase::CNowEvent_NextPhase() : m_PhaseText(nullptr)
{
	m_PhaseText = CUi::Create(CUi::UITYPE::PHASETEXT, CObject2D::POLYGONTYPE::SENTERROLLING, 200.0f, 100.0f, 100, false,
		D3DXVECTOR3(SCREEN_WIDTH , SCREEN_HEIGHT / 2, 0.0f), D3DXVECTOR3(sinf(D3DX_PI * -0.5f) * 10.0f, cosf(D3DX_PI * -0.5f) * 10.0f, 0.0f),
		D3DXVECTOR3(0.0f, 0.0f, 0.0f), D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f));//左に文字を飛ばす
	m_PhaseText->SetUseDeath(false);//死亡フラグをオフにする
}
//======================================================================================================================================

//=====================================================================
//デストラクタ
//=====================================================================
CNowEvent_NextPhase::~CNowEvent_NextPhase()
{
	//フェーズの文字を破棄
	if (m_PhaseText != nullptr)
	{
		m_PhaseText->SetUseDeath(true);
		m_PhaseText->SetDeath();
		m_PhaseText = nullptr;
	}
}
//======================================================================================================================================

//=====================================================================
//処理
//=====================================================================
void CNowEvent_NextPhase::Process(CEventManager* pEventManager)
{
    CEventManager::EventProgressInfo& eventProgressInfo = pEventManager->GetEventProgressInfo();
	switch (eventProgressInfo.nEventPattern)
	{
	case 0:
		if (m_PhaseText->GetPos().x >= SCREEN_WIDTH / 2 - 20.0f &&
			m_PhaseText->GetPos().x <= SCREEN_WIDTH / 2 + 20.0f)
		{
			m_PhaseText->SetMove(m_PhaseText->GetMove() * 0.1f);//速度を半減する
			eventProgressInfo.NextPattern();//パターンを次に進める
		}
		break;
	case 1:
		if (eventProgressInfo.nCntEventTime == 120)
		{
			m_PhaseText->SetMove(m_PhaseText->GetMove() * 10.0f);//速度を戻す
			eventProgressInfo.NextPattern();//パターンを次に進める
		}
		break;
	case 2:
		if (m_PhaseText->GetPos().x + m_PhaseText->GetWidth() / 2 <= 0.0f)
		{//文字テクスチャが完全にいなくなったら
			eventProgressInfo.ResetPattern();//パターンをリセット
			pEventManager->ChengeEvent(DBG_NEW CNowEvent());
		}
		break;
	default:
		break;
	}
}
//======================================================================================================================================