//==============================================================================================================
//
//１０月２８日：ロックオンした場所に弾を撃ちたい[lockon.cpp]
//Author:ShinaTaiyo
//
//==============================================================================================================

//===============================================================
//インクルード
//===============================================================
#include "lockon.h"
#include "manager.h"
#include "camera.h"
#include "texture.h"
#include "input.h"
#include "calculation.h"
#include "debugproc.h"
//==============================================================================================================

//===============================================================
//コンストラクタ
//===============================================================
CLockon::CLockon() : m_LockOnPos(NULL_VECTOR3)
{

}
//==============================================================================================================

//===============================================================
//デストラクタ
//===============================================================
CLockon::~CLockon()
{

}
//==============================================================================================================

//===============================================================
//初期化処理
//===============================================================
HRESULT CLockon::Init()
{
	CObject2D::Init();
	return S_OK;
}
//==============================================================================================================

//===============================================================
//終了処理
//===============================================================
void CLockon::Uninit()
{
	CObject2D::Uninit();
}
//==============================================================================================================

//===============================================================
//更新処理
//===============================================================
void CLockon::Update()
{
	//移動処理
	MoveProcess();

	//レイの処理
	SearchProcess();

	//オブジェクト2D更新処理
	CObject2D::Update();
}
//==============================================================================================================

//===============================================================
//描画処理
//===============================================================
void CLockon::Draw()
{
	CObject2D::Draw();
}
//==============================================================================================================

//===============================================================
//死亡フラグ設定処理
//===============================================================
void CLockon::SetDeath()
{
	CObject::SetDeath();
}
//==============================================================================================================

//===============================================================
//生成処理
//===============================================================
CLockon* CLockon::Create(D3DXVECTOR3 Pos, CObject2D::POLYGONTYPE PolygonType, float fWidth, float fHeight, D3DXCOLOR col)
{
	CTexture* pTexture = CManager::GetTexture();
	CLockon* pLockOn = DBG_NEW CLockon;

	pLockOn->Init();//初期化処理
	pLockOn->SetPos(Pos);//位置設定
	pLockOn->SetSupportPos(Pos);//支点位置設定
	pLockOn->SetInfo(1, 1, fWidth, fHeight, col,PolygonType,false);//情報設定（必ず）

	//テクスチャ設定
	pLockOn->SetTextureIndex(pTexture->Regist("data\\TEXTURE\\LockOn\\Target_000.png"));
	pLockOn->BindTexture(pTexture->GetAddress(pLockOn->GetTextureIndex()));

	//体力を使用しない
	pLockOn->SetUseLife(false, 1, 1);

	//オブジェクトタイプ設定
	pLockOn->SetType(CObject::TYPE_LOCKON);


	return pLockOn;
}
//==============================================================================================================

//===============================================================
//移動処理
//===============================================================
void CLockon::MoveProcess()
{
	D3DXVECTOR3 Pos = GetPos();
	if (CManager::GetInputJoypad()->GetRStickPress(16) == true)
	{
		Pos.x += sinf(CManager::GetInputJoypad()->GetRStickAimRot()) * m_fNORMAL_LOCKONMOVE;
		Pos.y += cosf(CManager::GetInputJoypad()->GetRStickAimRot()) * -m_fNORMAL_LOCKONMOVE;

		SetPos(Pos);
	}


}
//==============================================================================================================

//===============================================================
//カーソルの先にあるオブジェクトをサーチ
//===============================================================
void CLockon::SearchProcess()
{
	D3DXVECTOR3 Pos = GetPos();//位置

	CCalculation::CalcScreenToXZ(&m_LockOnPos, int(Pos.x), int(Pos.y), SCREEN_WIDTH, SCREEN_HEIGHT,
		CManager::GetCamera()->GetMtxView(), CManager::GetCamera()->GetMtxProjection());

	CManager::GetDebugProc()->PrintDebugProc("床または壁との交点：%f %f %f\n", m_LockOnPos.x, m_LockOnPos.y, m_LockOnPos.z);

}
//==============================================================================================================