//====================================================
//
//７月４日：チャージ攻撃を実装する[player.h]
//Author:ShinaTaiyo
//
//====================================================

#ifndef _PLAYER_H_  
#define _PLAYER_H_

//======================
//インクルード
//======================
#include "main.h"
#include "objectXAlive.h"
#include "lockon.h"
#include "player_actionmode.h"
//==========================================

//===========================================
//プレイヤー3Dクラス
//===========================================
class CPlayer : public CObjectXAlive
{
public:
	CPlayer(CPlayer_ActionMode * pPlayer_ActionMode);                  //コンストラクタ
	~CPlayer();                 //デストラクタ
	HRESULT Init() override;    //初期化処理
	void Uninit() override;     //終了処理
	void Update() override;     //更新処理
	void Draw() override;       //描画処理
	void SetDeath() override;   //死亡フラグを設定
	static CPlayer * Create(D3DXVECTOR3 pos,D3DXVECTOR3 rot,D3DXVECTOR3 move,D3DXVECTOR3 Scale);

	CLockon* GetLockOn() { return m_pLockOn; }//ロックオンのインスタンスを取得
private:
	//================================================
	//アクションモード列挙型
	//================================================
	enum class ACTIONMODE
	{
		SHOT = 0,
		DIVE,
		MAX
	};
	//===============================================================================================

	//================================================
    //静的メンバ
    //================================================
	static constexpr float m_fNORMALATTACK_SPEED = 10.0f;//通常攻撃の移動量を設定
	//===============================================================================================

	//================================================
	//変数宣言
	//================================================
	float m_fRotAim;                    //目的の向き
	CLockon* m_pLockOn;                 //ロックオンカーソルへのポインタ
	CPlayer_ActionMode* m_pActionMode;  //アクションモードへのポインタ
	ACTIONMODE m_NowActionMode;  //現在のアクションモード
	//===============================================================================================


	//================================================
	//プロトタイプ宣言
	//================================================

	//=============================
	//位置系
	//=============================
	void MoveProcess();//移動処理
	void AdjustRot();//向き調整処理
	void AdjustPos();//位置を調整する
	//================================================

	//=============================
	//モードチェンジ
	//=============================
	void ActionModeChenge();//アクションモードを変更する
	//===============================================================================================

	//=============================
	//判定系
	//=============================
	void CollisionProcess();//当たり判定処理全般
	void CollisionBlock();//ブロックとの当たり判定処理
};

#endif
